print("Две строки можно сцепить"+"с помощью оператора '+'.")
print("\nЭто строка"+" вряд ли удив"+"ит вас. " \
      + "Но интересно, что она - \n" + "одна длинная-длин " \
      + "на" + "я"+"строка, сцепленная " \
      + "из"+" двадцати двух\n"+"отдельных строк, разбитых " \
     + "на шесть строк. " + "Достаточно ли вы впечатлены?" +" Ну хватит.\n" \
      + "вот"+" наша"+" длинная" + " строка и закончилась!")
print("\nЕсли текст нравится, его можно и повторить. К примеру, ")
print("кто не любит пирожных? Тольки дураки не любит пирожных. А")
print("Пирожные" * 10000)